salara1960/stm32f411/Src/main.c
ADC_HandleTypeDef *portADC = NULL;
volatile uint16_t adcValue = 0;
volatile float VccF = 0.0;
uint32_t iadc_cnt = 0;
uint8_t startADC = 1;
uint16_t VccBuf[MAX_VCC_BUF] = {0};
uint8_t VccValCounter = 0;

float CompBuf[MAX_COMP_BUF] = {0};
uint8_t CompValCounter = 0;

uint32_t one_sec = 0;
uint32_t seconds = 0;
volatile uint8_t devError = 0;
uint32_t tmr_out = 0;
uint32_t errStatCnt = 0;
uint32_t cikl_out = _10s;

uint32_t snd_pack = 0;


#if defined(SET_MPU6050) || defined(SET_MPU9250)
	I2C_HandleTypeDef *portMPU = NULL;
	uint32_t cntMPU = 0;
	bool mpuPresent = false;
	uint8_t mpuStatus = 0;
	uint8_t mpuInitErr = 1;
	uint8_t mpuID = 0;//0x71
	uint8_t akmID = 0;//0x48
#endif


struct mallinfo mem_info;


#ifdef SET_IRED

	const one_key_t keyAll[MAX_IRED_KEY] = {
			{"irCH-",   0xe318261b},
			{"irCH",    0x00511dbb},
			{"irCH+",   0xee886d7f},
			{"irLEFT",  0x52a3d41f},
			{"irRIGHT", 0xd7e84b1b},
			{"irSP",    0x20fe4dbb},
			{"ir-",     0xf076c13b},
			{"ir+",     0xa3c8eddb},
			{"irEQ",    0xe5cfbd7f},
			{"ir100+",  0x97483bfb},
			{"ir200+",  0xf0c41643},
			{"ir0",     0xc101e57b},
			{"ir1",     0x9716be3f},
			{"ir2",     0x3d9ae3f7},
			{"ir3",     0x6182021b},
			{"ir4",     0x8c22657b},
			{"ir5",     0x488f3cbb},
			{"ir6",     0x0449e79f},
			{"ir7",     0x32c6fdf7},
			{"ir8",     0x1bc0157b},
			{"ir9",     0x3ec3fc1b}
	};

#endif

#if defined(SET_NET) || defined(SET_WIFI)
	uint8_t con_tcp = 0;
	char localIP[32] = {0};
	#ifdef SET_WIFI
		char rxDataWIFI[MAX_TMP_SIZE] = {0};
		char rxByteWIFI = '\0';
		uint8_t rx_uk_wifi = 0;
	#endif
#endif

#ifdef SET_NET
	//#define HTTP_SOCKET     0
	//#define PORT_TCPS		9000
	//#define DATA_BUF_SIZE   2048

	//uint8_t gDATABUF[DATA_BUF_SIZE];

	char netChipID[16] = {0};
	int dhcpSOC = 0;
	int udpSOC = 1;
	int tcpSOC = 2;
	uint8_t stat_dhcp = DHCP_STOPPED;
	volatile uint8_t ip_assigned = 0;
	volatile uint32_t net_cnt = 0;
	uint8_t udpAddr[4] = {101};
	uint16_t udpPort = 8004;
	uint16_t tcpPort = 8008;
	char udpText[128] = {0};
	int mlen = 0;//sprintf(udpText, "Message from device=%s ip=%s\r\n", netChipID, localIP);
	char tcpBuf[256] = {0};
	char tcpTmp[128] = {0};

	int32_t cnt_udp = 0;
	int32_t cnt_tcp = 0;
	uint32_t udp_pack_num = 0;
	uint8_t en_udp = 0;
	uint8_t en_tcp = 0;
	int8_t usoc = -1;
	int8_t tsoc = -1;


	wiz_NetInfo gWIZNETINFO = {
				.mac = {0x00, 0x08, 0xdc, 0x47, 0x47, 0x54},
				.ip = {192, 168, 0, 150},
				.sn = {255, 255, 255, 0},
				.gw = {192, 168, 0, 1},
				.dns = {0, 0, 0, 0},
				.dhcp = NETINFO_STATIC};

	//--------------------------------------------------------------------------
	void W5500_Reset()
	{
		HAL_GPIO_WritePin(NET_RST_GPIO_Port, NET_RST_Pin, GPIO_PIN_RESET);
		HAL_Delay(2);
		HAL_GPIO_WritePin(NET_RST_GPIO_Port, NET_RST_Pin, GPIO_PIN_SET);
		HAL_Delay(20);
	}
	//--------------------------------------------------------------------------
	void W5500_Select() { CS_NET_SELECT(); }
	void W5500_Unselect() { CS_NET_DESELECT(); }
	//--------------------------------------------------------------------------
	void W5500_ReadBuff(uint8_t* buff, uint16_t len)
	{
	    if (HAL_SPI_Receive(&hspi4, buff, len, HAL_MAX_DELAY) != HAL_OK) devError |= devNet;
	}
	//--------------------------------------------------------------------------
	void W5500_WriteBuff(uint8_t* buff, uint16_t len)
	{
	    if (HAL_SPI_Transmit(&hspi4, buff, len, HAL_MAX_DELAY) != HAL_OK) devError |= devNet;

	    /*if (HAL_SPI_Transmit_DMA(&hspi4, buff, len) != HAL_OK) devError |= devNet;
	    while (1) {
	    	HAL_SPI_StateTypeDef stat = HAL_SPI_GetState(&hspi4);
	    	if ((stat == HAL_SPI_STATE_BUSY_RX) || (stat == HAL_SPI_STATE_READY)) break;
	    }*/

	}
	//--------------------------------------------------------------------------
	uint8_t W5500_ReadByte()
	{
	    uint8_t byte;
	    if (HAL_SPI_Receive(&hspi4, &byte, sizeof(uint8_t), HAL_MAX_DELAY) != HAL_OK) devError |= devNet;
	    return byte;
	}
	//--------------------------------------------------------------------------
	void W5500_WriteByte(uint8_t byte)
	{
		if (HAL_SPI_Transmit(&hspi4, &byte, sizeof(uint8_t), HAL_MAX_DELAY) != HAL_OK) devError |= devNet;
	}
	//--------------------------------------------------------------------------
	void Callback_IPAssigned() {
	    //UART_Printf("Callback: IP assigned! Leased time: %d sec\r\n", getDHCPLeasetime());
		getIPfromDHCP(gWIZNETINFO.ip);
		getGWfromDHCP(gWIZNETINFO.gw);
		getSNfromDHCP(gWIZNETINFO.sn);
		sprintf(localIP, "%d.%d.%d.%d", gWIZNETINFO.ip[0], gWIZNETINFO.ip[1], gWIZNETINFO.ip[2], gWIZNETINFO.ip[3]);
		memcpy(udpAddr, gWIZNETINFO.ip, 3);
	    ip_assigned = 1;
	}
	//--------------------------------------------------------------------------
	void Callback_IPConflict() {
	    //UART_Printf("Callback: IP conflict!\r\n");
		devError |= devNet;
	}
	//--------------------------------------------------------------------------
	static char *socStatus(int code)
	{
		switch (code) {
			case SOCK_CLOSED://            0x00
				return "Closed";
			case SOCKERR_SOCKNUM://       (SOCK_ERROR - 1)     ///< Invalid socket number
				return "Invalid socket number";
			case SOCKERR_SOCKOPT://       (SOCK_ERROR - 2)     ///< Invalid socket option
				return "Invalid socket option";
			case SOCKERR_SOCKINIT://      (SOCK_ERROR - 3)     ///< Socket is not initialized or SIPR is Zero IP address when Sn_MR_TCP
				return "Socket is not init or SIPR is Zero IP";
			case SOCKERR_SOCKCLOSED://    (SOCK_ERROR - 4)     ///< Socket unexpectedly closed.
				return "Socket unexpectedly closed";
			case SOCKERR_SOCKMODE://      (SOCK_ERROR - 5)     ///< Invalid socket mode for socket operation.
				return "Invalid socket mode";
			case SOCKERR_SOCKFLAG://      (SOCK_ERROR - 6)     ///< Invalid socket flag
				return "Invalid socket flag";
			case SOCKERR_SOCKSTATUS://    (SOCK_ERROR - 7)     ///< Invalid socket status for socket operation.
				return "Invalid socket status";
			case SOCKERR_ARG://           (SOCK_ERROR - 10)    ///< Invalid argument.
				return "Invalid argument";
			case SOCKERR_PORTZERO://      (SOCK_ERROR - 11)    ///< Port number is zero
				return "Zero Port number";
			case SOCKERR_IPINVALID://     (SOCK_ERROR - 12)    ///< Invalid IP address
				return "Invalid IP";
			case SOCKERR_TIMEOUT://       (SOCK_ERROR - 13)    ///< Timeout occurred
				return "Timeout";
			case SOCKERR_DATALEN://       (SOCK_ERROR - 14)    ///< Data length is zero or greater than buffer max size.
				return "Zero data length";
			case SOCKERR_BUFFER://        (SOCK_ERROR - 15)    ///< Socket buffer is not enough for data communication.
				return "Socket data buffer is not enough";
			case SOCK_LISTEN://                  0x14
				return "Listen";
			case SOCK_ESTABLISHED://             0x17
				return "Connected";
			case SOCK_FIN_WAIT://                0x18
				return "Disconnected";
			case SOCK_CLOSING://                 0x1A
				return "Socket closed";
			case SOCK_CLOSE_WAIT://              0x1C
				return "Client closed connection";
			default : return "Unkown";
		}
	}
	//--------------------------------------------------------------------------
	void getPhyStatus()
	{
		uint8_t reg = getPHYCFGR();

		char tp[64] = {0};
		strcpy(tp, "Lan:");
		if (reg & PHYCFGR_LNK_ON) strcat(tp, "Up");
		                     else strcat(tp, "Down");

		if (reg & PHYCFGR_SPD_100) strcat(tp, " 100");
		                      else strcat(tp, " 10");

		if (reg & PHYCFGR_DPX_FULL) strcat(tp, "Full");
		                       else strcat(tp, "Half");

