salara1960/stm32f411/Src/main.c
	if (huart->Instance == USART1) {
		rxData[rx_uk & 0x7f] = rxByte;
		if (rxByte == '\n') {//end of line
			rxData[(rx_uk + 1) & 0x7f] = '\0';
			strcpy(stx, rxData);//, rx_uk + 1);

			rx_uk = 0;
			memset(rxData, 0, sizeof(rxData));
			putMsg(msg_rxDone);
		} else rx_uk++;

		HAL_UART_Receive_IT(&huart1, (uint8_t *)&rxByte, 1);

	}
#ifdef SET_BLE
	else if (huart->Instance == USART2) {
		rxDataBLE[rx_uk_ble & 0x7f] = rxByteBLE;
		if (rxByteBLE == '\n') {//end of line
			rxDataBLE[(rx_uk_ble + 1) & 0x7f] = '\0';
			strcpy(stx_ble, rxDataBLE);//, rx_uk_ble + 1);

			rx_uk_ble = 0;
			memset(rxDataBLE, 0, sizeof(rxDataBLE));
			putMsg(msg_rxDoneBLE);
		} else rx_uk_ble++;

		HAL_UART_Receive_IT(&huart2, (uint8_t *)&rxByteBLE, 1);

	}
#endif

}
//-----------------------------------------------------------------------------
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)// TX via DMA done !!!
{
	if (huart->Instance == USART1) txDoneFlag = 1;
#ifdef SET_BLE
	else
	if (huart->Instance == USART2) txDoneFlagBLE = 1;
#endif
}
//-----------------------------------------------------------------------------
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
	if ((huart->Instance == USART1) || (huart->Instance == USART1)) devError |= devUART;
}
//-----------------------------------------------------------------------------
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
	if (GPIO_Pin == iKEY_Pin) {
		devError = devOK;
		putMsg(msg_out);
	}
#if defined(SET_NET)
	else if (GPIO_Pin == NET_EXTI4_Pin) {
		net_cnt++;
	}
#elif defined(SET_BLE)
	else if (GPIO_Pin == BLE_EXTI3_Pin) {
		ble_stat = HAL_GPIO_ReadPin(BLE_EXTI3_GPIO_Port, BLE_EXTI3_Pin);
	}
#elif defined(SET_WIFI)
	else if (GPIO_Pin == WIFI_BUSY_Pin) {
		if (HAL_GPIO_ReadPin(WIFI_BUSY_GPIO_Port, WIFI_BUSY_Pin)) con_tcp = 0; else con_tcp = 1;
	}
#endif
}
//-----------------------------------------------------------------------------
#if defined(SET_BMx280) || defined(SET_COMPAS)
	void HAL_I2C_ErrorCallback(I2C_HandleTypeDef *hi2c)
	{
		if (hi2c->Instance == I2C1) devError |= devI2C1;
	}
	//-----------------------------------------------------------------------------
	void HAL_I2C_MasterTxCpltCallback(I2C_HandleTypeDef *hi2c)
	{
		if (hi2c->Instance == I2C1) {
			tx_icnt++;
			putMsg(msg_i2c);
		}
	}
	void HAL_I2C_MasterRxCpltCallback(I2C_HandleTypeDef *hi2c)
	{
		if (hi2c->Instance == I2C1) {
			rx_icnt++;
			putMsg(msg_i2c);
		}
	}
#endif
//-----------------------------------------------------------------------------
#if defined(SET_OLED_SPI) || defined(SET_IPS) || defined(SET_NET) || defined(SET_WIFI)
void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef *hspi)
{
	if (hspi->Instance == SPI2) {//OLED or IPS display
#if defined(SET_OLED_SPI)
		if (withDMA) {
			CS_OLED_DESELECT();
			spiRdy = 1;
		}
		spi_cnt++;
#elif defined(SET_IPS)
	#ifdef SET_WITH_CS
		ST7789_SelOFF();
	#endif
		dma_spi2_cnt--;
		if (!dma_spi2_cnt) {
			HAL_SPI_DMAStop(portOLED);
			dma_spi2_flag = dma_spi2_cnt = 1;
		}
		spi_cnt++;
#endif
	} else if (hspi->Instance == SPI4) {//NET or WIFI module
#if defined(SET_NET)
		//
#elif defined(SET_WIFI)
		if (!txDoneFlagWIFI) {
			CS_NET_DESELECT();
			txDoneFlagWIFI = 1;
		}
#endif
	}
}
//-----------------------------------------------------------------------------
void HAL_SPI_RxCpltCallback(SPI_HandleTypeDef *hspi)
{
	if (hspi->Instance == SPI4) {
#ifdef SET_WIFI
		rxDoneFlagWIFI = 1;
#endif
	}
}
//-----------------------------------------------------------------------------
void HAL_SPI_ErrorCallback(SPI_HandleTypeDef *hspi)
{
	if ((hspi->Instance == SPI2) || (hspi->Instance == SPI4)) devError |= devSPI;
}
#endif
//-----------------------------------------------------------------------------
int sec_to_str_time(char *st)
{
RTC_TimeTypeDef sTime;
RTC_DateTypeDef sDate;

	HAL_RTC_GetDate(&hrtc, &sDate, RTC_FORMAT_BIN);
	HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
	return (sprintf(st, "%02u.%02u %02u:%02u:%02u",
						sDate.Date, sDate.Month,
						sTime.Hours, sTime.Minutes, sTime.Seconds));
}
//-------------------------------------------------------------------------------------------
void Report(const char *tag, unsigned char addTime, const char *fmt, ...)
{
va_list args;
size_t len = MAX_UART_BUF;
int dl = 0;
//char *buff = &txData[0];

	char *buff = (char *)calloc(1, len);//pvPortMalloc(len);//vPortFree(buff);
	if (buff) {

		if (addTime) dl = sec_to_str_time(buff);
		if (tag) dl += sprintf(buff+strlen(buff), "[%s] ", tag);

		va_start(args, fmt);
		vsnprintf(buff + dl, len - dl, fmt, args);
		va_end(args);

		putData(buff);

		/*if (txDoneFlag) {
			txDoneFlag = 0;
			HAL_UART_Transmit_DMA(&huart1, (uint8_t *)buff, strlen(buff));
			//HAL_UART_Transmit(&huart1, (uint8_t *)buff, strlen(buff), 1000);

			//while (HAL_UART_GetState(&huart1) != HAL_UART_STATE_READY) {
			//	if (HAL_UART_GetState(&huart1) == HAL_UART_STATE_BUSY_RX) break;
			//	//HAL_Delay(1);
			//}
		}

#ifdef SET_NET
		if (con_tcp) {
			send(tcpSOC, (uint8_t *)buff, strlen(buff));
		}
#endif

//		free(buff);//vPortFree(buff);
*/
	}

}
//------------------------------------------------------------------------------------------
void set_Date(time_t ep)
{
struct tm ts;

	//setSec((uint32_t)ep);

	if (!localtime_r(&ep, &ts)) return;

	RTC_TimeTypeDef sTime;
	RTC_DateTypeDef sDate;
	sDate.WeekDay = ts.tm_wday;
	sDate.Month   = ts.tm_mon + 1;
	sDate.Date    = ts.tm_mday;
	sDate.Year    = ts.tm_year;
	sTime.Hours   = ts.tm_hour + tZone;
	sTime.Minutes = ts.tm_min;
	sTime.Seconds = ts.tm_sec;
	if (HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BIN) == HAL_OK) {
		if (HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BIN) == HAL_OK) setDate = 1;
	}

}
//
//------------------------------------------------------------------------------------------
uint32_t get_DateTime()
{
struct tm ts;
RTC_TimeTypeDef sTime;
RTC_DateTypeDef sDate;

	if (HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN) != HAL_OK) return 0;
	if (HAL_RTC_GetDate(&hrtc, &sDate, RTC_FORMAT_BIN) != HAL_OK) return 0;

	ts.tm_hour = sTime.Hours;
	ts.tm_min  = sTime.Minutes;
	ts.tm_sec  = sTime.Seconds;

	ts.tm_wday = sDate.WeekDay;
	ts.tm_mon  = sDate.Month - 1;
	ts.tm_mday = sDate.Date;
	ts.tm_year = sDate.Year;

	return ((uint32_t)mktime(&ts));
}
//-------------------------------------------------------------------------------------------
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *hadc)
{
	if (hadc->Instance == ADC1) {
		iadc_cnt++;
		startADC = 0;
		putMsg(msg_adcReady);
	}
}
//-------------------------------------------------------------------------------------------
void HAL_ADC_ErrorCallback(ADC_HandleTypeDef *hadc)
{
	if (hadc->Instance == ADC1) devError |= devADC;
}
//-------------------------------------------------------------------------------------------
uint8_t VccAddVal(uint16_t value)
{
int8_t i;

	if (!VccValCounter) {
		for (i = 0; i < MAX_VCC_BUF; i++) VccBuf[i] = value;
		VccValCounter = MAX_VCC_BUF;
	} else {
		for (i = MAX_VCC_BUF - 2; i >= 0; i--) VccBuf[i + 1] = VccBuf[i];
		VccBuf[0] = value;
		if (VccValCounter < MAX_VCC_BUF) VccValCounter++;
	}
    return VccValCounter;
}
//-------------------------------------------------------------------------------------------
#ifdef SET_COMPAS
uint8_t CompAddVal(float value)
{
int8_t i;

	if (!CompValCounter) {
		for (i = 0; i < MAX_COMP_BUF; i++) CompBuf[i] = value;
		CompValCounter = MAX_COMP_BUF;
	} else {
		for (i = MAX_COMP_BUF - 2; i >= 0; i--) CompBuf[i + 1] = CompBuf[i];
		CompBuf[0] = value;
		if (CompValCounter < MAX_COMP_BUF) CompValCounter++;
	}
    return CompValCounter;
}
//-------------------------------------------------------------------------------------------
void procCompas()
{
	cStat = COPMAS_ReadStat() & 1;
	if (cStat) {
		if (COPMAS_GetAngle() != HAL_OK) devError |= devI2C1;
	}
}
#endif
//------------------------------------------------------------------------------------------

#ifdef SET_MPU9250

