salara1960/stm32f411/Src/main.c
//------------------------------------------------------------------------------------------
#endif

//------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------
void ackParse(char *st)
{
char *uk, *uke;

	if ((uk = strstr(st, "epoch=")) != NULL) {
		uk += 6;
		if (strlen(uk) >= 10) {
			uke = strchr(uk, ':');
			if (uke) {
				tZone = atoi(uke + 1);
				*uke = '\0';
			} else tZone = 0;
			uint32_t cep = atol(uk);
			if (cep > 0) set_Date((time_t)cep);
		}
	}
#ifdef SET_NET
	else if (strstr(st, "udp_on") != NULL) {
		en_udp = 1;
	} else if (strstr(st, "udp_off") != NULL) {
		en_udp = 0;
		if (usoc == udpSOC) close(udpSOC);
		usoc = -1;
		cnt_udp = 0;
		udp_pack_num = 0;
	} else if (strstr(st, "tcp_on") != NULL) {
		en_tcp = 1;
	} else if (strstr(st, "tcp_off") != NULL) {
		en_tcp = 0;
		if (tsoc == tcpSOC) close(tcpSOC);
		tsoc = -1;
		cnt_tcp = 0;
		con_tcp = 0;
	} else if (strstr(st, "lan") != NULL) {
		getPhyStatus();
	}
#endif
#ifdef SET_BLE
	else if (strstr(st, "ble_mac") != NULL) {//key_7
		bleCmd = iMAC;
		putMsg(msg_wrBLE);
	} else if (strstr(st, "ble_uuid") != NULL) {//key_8
		bleCmd = iUUID;
		putMsg(msg_wrBLE);
	} else if (strstr(st, "ble_rst") != NULL) {//key_9
		bleCmd = iRST;
		putMsg(msg_wrBLE);
	}
#endif
	else if (strstr(st, "jtune_on") != NULL) {//key_100
		jtune = 1;
	} else if (strstr(st, "jtune_off") != NULL) {//key_200
		jtune = 0;
	}
#ifdef SET_cJSON
	else if (strstr(st, "cjson") != NULL) {//key_2
		outMode = cjsonMode;
	}
#endif
	else if (strstr(st, "json") != NULL) {//key_1
		outMode = jsonMode;
	} else if (strstr(st, "text") != NULL) {//key_0
		outMode = textMode;
	}
	else if (strstr(st, "dbg_on") != NULL) {//key_3
		outDebug = 1;
	} else if (strstr(st, "dbg_off") != NULL) {//key_4
		outDebug = 0;
	} else if (strstr(st, "get") != NULL) {//key_eq
		tmr_out = getTimer(_1ms);
	} else if (strstr(st, "rst") != NULL) {//key_ch
		putMsg(msg_rst);
	} else if ((uk = strstr(st, "period=")) != NULL) {//key_minus : -100ms, key_plus : +100ms
		int val = atoi(uk + 7);
		if ((val > 0) && (val <= 30000)) cikl_out = val;
	}

}
//------------------------------------------------------------------------------------------
char *printOut(char *tmp)
{

switch (outMode) {

#ifdef SET_cJSON
	case cjsonMode:
	{
		cJSON *obj = cJSON_CreateObject();
		if (obj) {
			char dt[32] = {0};
			sec_to_str_time(dt);
			cJSON_AddItemToObject(obj, "time", cJSON_CreateString(dt));
			cJSON_AddItemToObject(obj, "ms", cJSON_CreateNumber(tik));
			cJSON *arr1 = cJSON_CreateArray();
			if (arr1) {
				cJSON_AddItemToArray(arr1, cJSON_CreateNumber((int)cnt_evt));
				cJSON_AddItemToArray(arr1, cJSON_CreateNumber((int)max_evt));
				cJSON_AddItemToObject(obj, "fifo", arr1);
			} else devError |= devMem;
			cJSON_AddItemToObject(obj, "devError", cJSON_CreateNumber(devError));
			cJSON_AddItemToObject(obj, "volt", cJSON_CreateNumber(VccF));
			//
#ifdef SET_BMx280
			cJSON *sens1 = cJSON_CreateObject();
			if (sens1) {
				cJSON_AddItemToObject(sens1, "pres", cJSON_CreateNumber(sensors.bmx_pres));
				cJSON_AddItemToObject(sens1, "temp", cJSON_CreateNumber(sensors.bmx_temp));
				if (reg_id == BME280_SENSOR) cJSON_AddItemToObject(sens1, "humi", cJSON_CreateNumber(sensors.bmx_humi));
				cJSON_AddItemToObject(obj, bmxName, sens1);
			} else devError |= devMem;
#endif
#ifdef SET_COMPAS
			//
			cJSON *sens2 = cJSON_CreateObject();
			if (sens2) {
				cJSON_AddItemToObject(sens2, "azimut", cJSON_CreateNumber(compData.angleHMC));
				cJSON_AddItemToObject(sens2, "temp2", cJSON_CreateNumber(compData.tempHMC));
				cJSON_AddItemToObject(obj, "QMC5883L", sens2);
			} else devError |= devMem;
#endif
			//
#ifdef SET_MPU6050
			cJSON *sens3 = cJSON_CreateObject();
			if (sens3) {
				cJSON_AddItemToObject(sens3, "stat", cJSON_CreateNumber(mpuStatus));
				cJSON_AddItemToObject(sens3, "temp3", cJSON_CreateNumber(mpu_data.TEMP));
				cJSON *arr2 = cJSON_CreateArray();
				if (arr2) {
					cJSON_AddItemToArray(arr2, cJSON_CreateNumber(mpu_data.xACCEL));
					cJSON_AddItemToArray(arr2, cJSON_CreateNumber(mpu_data.yACCEL));
					cJSON_AddItemToArray(arr2, cJSON_CreateNumber(mpu_data.zACCEL));
					cJSON_AddItemToObject(sens3, "accel", arr2);
				} else devError |= devMem;
				cJSON *arr3 = cJSON_CreateArray();
				if (arr3) {
					cJSON_AddItemToArray(arr3, cJSON_CreateNumber(mpu_data.xGYRO));
					cJSON_AddItemToArray(arr3, cJSON_CreateNumber(mpu_data.yGYRO));
					cJSON_AddItemToArray(arr3, cJSON_CreateNumber(mpu_data.zGYRO));
					cJSON_AddItemToObject(sens3, "gyro", arr3);
				} else devError |= devMem;
				cJSON_AddItemToObject(obj, "MPU6050", sens3);
			} else devError |= devMem;
#endif
			//
			char *st = cJSON_PrintBuffered(obj, sizeof(tmp) - 1, jtune);
			if (st) {
				strcpy(tmp, st);
				strcat(tmp, ">");
				free(st);
			}

			cJSON_Delete(obj);

		} else devError |= devMem;
	}
	break;
#endif

	case jsonMode:
	{
		char dt[32] = {0};
		sec_to_str_time(dt);
		if (jtune) {
			sprintf(tmp, "{%s  \"time\": \"%s\",%s  \"ms\": %lu,%s  \"fifo\": [%u,%u]",
					cr_lf, dt, cr_lf, tik, cr_lf, cnt_evt, max_evt);
			sprintf(tmp+strlen(tmp), ",%s  \"devError\": %X", cr_lf, devError);
			sprintf(tmp+strlen(tmp), ",%s  \"volt\": %.3f", cr_lf, VccF);
#ifdef SET_BMx280
			sprintf(tmp+strlen(tmp), ",%s  \"%s\": {%s    \"pres\": %.2f,%s    \"temp\": %.2f",
					cr_lf, bmxName, cr_lf, sensors.bmx_pres, cr_lf, sensors.bmx_temp);
			if (reg_id == BME280_SENSOR) sprintf(tmp+strlen(tmp), ",%s    \"humi\": %.2f", cr_lf, sensors.bmx_humi);
			sprintf(tmp+strlen(tmp), "%s  }", cr_lf);
#endif
#ifdef SET_COMPAS
			sprintf(tmp+strlen(tmp), ",%s  \"QMC5883L\": {%s    \"azimut\": %.2f,%s    \"temp2\": %.2f%s  }" ,
					cr_lf, cr_lf, compData.angleHMC, cr_lf, compData.tempHMC, cr_lf);
#endif
#ifdef SET_MPU6050
			sprintf(tmp+strlen(tmp), ",%s  \"MPU6050\": {%s    \"stat\": %X,%s    \"temp3\": %.2f,%s    \"accel\": [%d,%d,%d],%s    \"gyro\": [%d,%d,%d]%s  }%s",
							cr_lf, cr_lf,
							mpuStatus, cr_lf,
							mpu_data.TEMP, cr_lf,
							mpu_data.xACCEL, mpu_data.yACCEL, mpu_data.zACCEL, cr_lf,
							mpu_data.xGYRO, mpu_data.yGYRO, mpu_data.zGYRO, cr_lf, cr_lf);
#endif
		} else {
			sprintf(tmp, "{\"time\": \"%s\",\"ms\": %lu,\"fifo\": [%u,%u]", dt, tik, cnt_evt, max_evt);
			sprintf(tmp+strlen(tmp), ",\"devError\": %X", devError);
			sprintf(tmp+strlen(tmp), ",\"volt\": %.3f", VccF);
#ifdef SET_BMx280
			sprintf(tmp+strlen(tmp), ",\"%s\": {\"press\": %.2f,\"temp\": %.2f",
					bmxName, sensors.bmx_pres, sensors.bmx_temp);
			if (reg_id == BME280_SENSOR) sprintf(tmp+strlen(tmp), ",\"humi\": %.2f", sensors.bmx_humi);
			strcat(tmp, "}");
#endif
#ifdef SET_COMPAS
			sprintf(tmp+strlen(tmp), ",\"QMC5883L\": {\"azimut\": %.2f,\"temp2\": %.2f}", compData.angleHMC, compData.tempHMC);
#endif
#ifdef SET_MPU6050
			sprintf(tmp+strlen(tmp), ",\"MPU6050\": {\"stat\": %X,\"temp3\": %.2f,\"accel\": [%d,%d,%d],\"gyro\": [%d,%d,%d]}",
							mpuStatus,
							mpu_data.TEMP,
							mpu_data.xACCEL, mpu_data.yACCEL, mpu_data.zACCEL,
							mpu_data.xGYRO, mpu_data.yGYRO, mpu_data.zGYRO);
#endif

