salara1960/stm32f411/Src/main.c
		}
		strcat(tmp, "}>");
	}
	break;

	default : {// textMode

		sprintf(tmp, " | ms=%lu fifo:%u/%u", tik, cnt_evt, max_evt);
		sprintf(tmp+strlen(tmp), " devError=%X", devError);
		sprintf(tmp+strlen(tmp), " | Vcc=%.3f", VccF);
#ifdef SET_BMx280
		sprintf(tmp+strlen(tmp)," | %s: pres=%.2f temp=%.2f",
								bmxName, sensors.bmx_pres, sensors.bmx_temp);
		if (reg_id == BME280_SENSOR) sprintf(tmp+strlen(tmp), " humi=%.2f", sensors.bmx_humi);
#endif
#ifdef SET_COMPAS
		//compas_stat_t *cStat = (compas_stat_t *)confRegHmc;
		sprintf(tmp+strlen(tmp)," | QMC5883L: azimut=%.2f temp2=%.2f",
			    			compData.angleHMC,
							compData.tempHMC);
#endif
#ifdef SET_MPU6050
		sprintf(tmp+strlen(tmp)," | MPU6050: stat=%X temp3=%.2f accel=%d,%d,%d gyro=%d,%d,%d",
							mpuStatus,
							mpu_data.TEMP,
							mpu_data.xACCEL, mpu_data.yACCEL, mpu_data.zACCEL,
							mpu_data.xGYRO, mpu_data.yGYRO, mpu_data.zGYRO);
#endif

	}
}

	if (outDebug) {
		mem_info = mallinfo();
		sprintf(tmp+strlen(tmp), "\r\n(cnt_data=%u | noused=%d #freeChunk=%d #freeBlk=%d #mapReg=%d busy=%d max_busy=%d #freedBlk=%d used=%d free=%d top=%d)",
			cnt_data,
			mem_info.arena,// Non-mmapped space allocated (bytes)
			mem_info.ordblks,// Number of free chunks
			mem_info.smblks,// Number of free fastbin blocks
			mem_info.hblks,// Number of mmapped regions
			mem_info.hblkhd,// Space allocated in mmapped regions (bytes)
			mem_info.usmblks,// Maximum total allocated space (bytes)
			mem_info.fsmblks,// Space in freed fastbin blocks (bytes)
			mem_info.uordblks,// Total allocated space (bytes)
			mem_info.fordblks,// Total free space (bytes)
			mem_info.keepcost);// Top-most, releasable space (bytes)
	}

	return &tmp[0];
}
//-------------------------------------------------------------------------------------------
void toDisplay(char *line)
{
	line[0] = '\0';

#if defined(SET_OLED_SPI)
	if (!devError) sprintf(line+strlen(line), "  VCC:%.3fv\n", VccF);
			  else sprintf(line+strlen(line), " devError:0x%02X\n", devError);
	//if (mpuPresent) sprintf(line+strlen(line), " mpuTemp:%.2f%c\n", mpu_data.TEMP, gradus);
	sprintf(line+strlen(line), "  pres:%.2fmm\n  temp:%.2f%c\n", sensors.bmx_pres, sensors.bmx_temp, gradus);
	if (reg_id == BME280_SENSOR) sprintf(line+strlen(line), "  humi:%.2f%%\n", sensors.bmx_humi);
	#ifdef SET_MPU9250
		if (!mpuInitErr) {
			spi_ssd1306_clear_from_to(6, 8);
			if (mpuStatus) sprintf(line+strlen(line), " mpuStat: 0x%02X\n azimut:%.2f%c\n temp:%.2f%c\n",
					                    mpuStatus, compData.angleHMC, gradus, compData.tempHMC, gradus);
		} else {
			sprintf(line+strlen(line), "MPU not present\n");
		}
	#else
		#ifdef SET_COMPAS
			sprintf(line+strlen(line), " azimut:%.2f%c\n", compData.angleHMC, gradus);
		#endif
	#endif
	#if defined(SET_NET)
		if (ip_assigned) sprintf(line+strlen(line), " %s", localIP);
	#elif defined(SET_BLE)
		sprintf(line+strlen(line), " ble stat:%u", ble_stat);
	#elif defined(SET_WIFI)
		sprintf(line+strlen(line), " wifi ready : %u\n snd_pack : %u", con_tcp & 1, snd_pack);
	#endif
	spi_ssd1306_text_xy(line, 2, 2);
#elif defined(SET_IPS)
	if (!devError) sprintf(line+strlen(line), "    Vcc:%.3fv\n", VccF);
			  else sprintf(line+strlen(line), "   devError:0x%02X\n", devError);
	if (mpuPresent) {
		sprintf(line+strlen(line), "   mpuTemp:%.2f^\n", mpu_data.TEMP);
		sprintf(line+strlen(line), "   mpuAccel:%d,%d,%d\n", mpu_data.xACCEL, mpu_data.yACCEL, mpu_data.zACCEL);
		sprintf(line+strlen(line), "   mpuGyro:%d,%d,%d\n", mpu_data.xGYRO, mpu_data.yGYRO, mpu_data.zGYRO);
	}
	sprintf(line+strlen(line), "   pres:%.2fmm\n   temp:%.2f^\n", sensors.bmx_pres, sensors.bmx_temp);
	if (reg_id == BME280_SENSOR) sprintf(line+strlen(line), "   humi:%.2f%%\n", sensors.bmx_humi);
	#ifdef SET_MPU9250
		if (!mpuInitErr)
			sprintf(line+strlen(line), "MPU9250 present\n mpuStat: 0x%02X\na:%.2f%c t:%.2f%c\n",
								       mpuStatus, compData.angleHMC, gradus, compData.tempHMC, gradus);
		else
			sprintf(line+strlen(line), "MPU not present\n");
	#else
		#ifdef SET_COMPAS
			sprintf(line+strlen(line), "   azimut:%.2f^\n   temp2:%.2f^\n", compData.angleHMC, compData.tempHMC);
		#endif
	#endif
	#ifdef SET_NET
		if (ip_assigned) sprintf(line+strlen(line), "%s | %d", localIP, (int)cnt_udp);
	#endif
	#ifdef SET_BLE
		sprintf(line+strlen(line), " ble stat:%u", ble_stat);
	#endif
	ST7789_WriteString(0, tFont->height + (tFont->height * 0.75), line, *tFont, WHITE, BLACK);
#endif
//
}
//-------------------------------------------------------------------------------------------

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_RTC_Init();
  MX_TIM2_Init();
  MX_USART1_UART_Init();
  MX_I2C1_Init();
  MX_SPI4_Init();
  MX_ADC1_Init();
  MX_TIM4_Init();
  MX_SPI2_Init();
  MX_USART2_UART_Init();
  /* USER CODE BEGIN 2 */


  //wr_data = rd_data = 0;
  //for (int i = 0; i < max_prndata; i++) prndata[i].body = NULL;

#if defined(SET_OLED_SPI) || defined(SET_IPS)
    sprintf(devName, "Speed:%lu", huart1.Init.BaudRate);
#endif

  	/* start timer1 + interrupt
	HAL_TIM_Base_Start(&htim2);
	HAL_TIM_Base_Start_IT(&htim2);*/
    //"start" rx_interrupt
	HAL_UART_Receive_IT(&huart1, (uint8_t *)&rxByte, 1);

#ifdef SET_BLE
	//"start" rx_interrupt
	HAL_UART_Receive_IT(&huart2, (uint8_t *)&rxByteBLE, 1);
#endif
#ifdef SET_WIFI
	//HAL_SPI_Receive_DMA(&hspi4, (uint8_t *)&rxByteWIFI, 1);
	//WIFI_WriteBuff(uint8_t* buff, uint16_t len);
#endif


	evt_t evt;
	uint32_t schMS = 0;
	uint8_t setRTC = 0;

