salara1960/stm32f411/Src/main.c
	ON_ERR_LED();//!!!!!!!!!!!!!!!!!!!!!
	STROB_UP();//!!!!!!!!!!!!!!!!!!!!!


#if defined(SET_OLED_SPI) || defined(SET_IPS)
	portOLED = &hspi2;
#endif
#if defined(SET_OLED_SPI)
    spi_ssd1306_Reset();
    //spi_ssd1306_on(1);//screen ON
    spi_ssd1306_init();//screen INIT
    spi_ssd1306_pattern();//set any params for screen
    //spi_ssd1306_invert();
    spi_ssd1306_clear();//clear screen

    int8_t len8 = 0;

#elif defined(SET_IPS)

    ST7789_Reset();
    ST7789_Init();

    //fntKey = &Font_16x26;
    //tFont = &Font_11x18;

    //uint8_t on_ips = 0;
    //ipsOn(on_ips);

    ST7789_Fill(0, 0, ST7789_WIDTH - 1, fntKey->height, WHITE);
    ST7789_Fill(0, ST7789_WIDTH - fntKey->height, ST7789_WIDTH - 1, ST7789_HEIGHT - 1, YELLOW);

#endif


#ifdef SET_BMx280
    portBMP = &hi2c1;

    i2c_reset_bmx280(&reg_id);
    if (reg_id == BME280_SENSOR) {
    	d_size = 8;
    	strcpy(bmxName, bme280s);
    } else {
    	d_size = 6;
    	if (reg_id == BMP280_SENSOR) strcpy(bmxName, bmp280s); else strcpy(bmxName, bmx280s);
    }

    //bmxCalibr = bmx280_readCalibrationData(reg_id);
#endif

#ifdef SET_MPU9250
    portMPU = &hi2c1;
    mpuPresent = MPU9250_IsConnected();
    if (mpuPresent) {
    	mpuInitErr = MPU9250_Init(&mpuID, &akmID);
    }
#else
	#ifdef SET_MPU6050
    	portMPU = &hi2c1;
    	if (mpuChipID() == HAL_OK) {
    		if (mpuInit() == HAL_OK) {
    			mpuPresent = true;
    			mpuDisableInterrupts();
    		}
    	}
	#endif
#endif

#ifdef SET_NET

	//reset device
	W5500_Reset();

	reg_wizchip_cs_cbfunc(W5500_Select, W5500_Unselect);
	reg_wizchip_spi_cbfunc(W5500_ReadByte, W5500_WriteByte);
	reg_wizchip_spiburst_cbfunc(W5500_ReadBuff, W5500_WriteBuff);

	uint8_t tx_buff_sizes[] = {2, 2, 2, 2, 2, 2, 2, 2};
	uint8_t rx_buff_sizes[] = {2, 2, 2, 2, 2, 2, 2, 2};

	if (wizchip_init(tx_buff_sizes, rx_buff_sizes) != 0) {
		devError |= devNet;
	} else {
		memset(netChipID, 0, sizeof(netChipID));
		ctlwizchip(CW_GET_ID, (void *)&netChipID[0]);
		if (gWIZNETINFO.dhcp == NETINFO_STATIC) {//STATIC ADDR
			ctlnetwork(CN_SET_NETINFO, (void *)&gWIZNETINFO);
			ctlnetwork(CN_GET_NETINFO, (void *)&gWIZNETINFO);
			sprintf(localIP, "%d.%d.%d.%d", gWIZNETINFO.ip[0], gWIZNETINFO.ip[1], gWIZNETINFO.ip[2], gWIZNETINFO.ip[3]);

			ip_assigned = 1;
			memcpy(&udpAddr[0], (uint8_t *)&gWIZNETINFO.ip[0], 3);
			udpAddr[3] = 255;
		} else {//ADDR from DHCP
			ip_assigned = 0;
			uint8_t dhcpBuf[1024];

			setSHAR(gWIZNETINFO.mac);
			DHCP_init(dhcpSOC, dhcpBuf);
			reg_dhcp_cbfunc(Callback_IPAssigned, Callback_IPAssigned, Callback_IPConflict);

			if (!ip_assigned) {
				if (!((stat_dhcp == DHCP_IP_ASSIGN) ||
						(stat_dhcp == DHCP_IP_CHANGED) ||
							(stat_dhcp == DHCP_FAILED) ||
								(stat_dhcp == DHCP_IP_LEASED))) stat_dhcp = DHCP_run();
			}
		}
	}

	uint8_t netFlag = SF_IO_NONBLOCK | SF_BROAD_BLOCK;//SF_UNI_BLOCK;//SF_MULTI_BLOCK;//SF_BROAD_BLOCK;//SF_IO_NONBLOCK

	int32_t stat_udp;
	const uint8_t udp_sec_period = 10;
	uint8_t udp_sec = 5;

	int8_t stat_tcp = SOCKERR_SOCKCLOSED;
	uint8_t cliIP[4] = {0};
	uint8_t statSR = 0;

#endif


#ifdef SET_IRED
    HAL_GPIO_WritePin(irLED_GPIO_Port, irLED_Pin, GPIO_PIN_SET);
    //IRRED_LED();
	uint32_t tmr_ired = 0;
	enIntIRED();
#endif

    //---------------------------------------
	//"start" ADC interrupt
	portADC = &hadc1;
	if (startADC) HAL_ADC_Start_IT(portADC);
    //
    // start timer1 + interrupt
    HAL_TIM_Base_Start(&htim2);
    HAL_TIM_Base_Start_IT(&htim2);
    //
    //---------------------------------------

#ifdef SET_COMPAS
	portHMC = &hi2c1;
	xyz = (xyz_t *)&magBuf[0];
//	COPMAS_Reset();
	COPMAS_Init();
	cStat = COPMAS_ReadStat();
	#ifdef SET_COMPAS_BLOCK
    	siCmd = msg_empty;
    	evt = msg_startCompas;
	#else
    	siCmd = msg_startCompas;
    	evt = msg_i2c;
    	next = getTimer(_100ms);
	#endif
#else
	#if defined(SET_MPU9250)
    	siCmd = msg_empty;
    	evt = msg_startMPU;
    	next = getTimer(_100ms);
	#elif defined(SET_BMx280)
    	siCmd = msg_empty;
    	evt = msg_nextSens;
    	next = getTimer(_100ms);
	#endif
#endif

    tmr_out = getTimer(_1s);
    next = getTimer(0);
    errStatCnt = 0;

    putMsg(evt);


#if defined(SET_NET)
    en_udp = 1;
    if (usoc < 0) putMsg(msg_mkUdp);
    HAL_Delay(10);
    en_tcp = 1;
    if (tsoc < 0) putMsg(msg_mkTcp);
#elif defined(SET_BLE)
    bleReset(0);//hard reset

    //bleSpeed();//set speed to 115200
    ble_auth = 0;
    tmr_ble_auth = 0;
#elif defined(SET_WIFI)
    if (HAL_GPIO_ReadPin(WIFI_BUSY_GPIO_Port, WIFI_BUSY_Pin)) con_tcp = 0; else con_tcp = 1;
#endif

    uint8_t first_sec = 0;
    //HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
	while (1)  {


#ifdef SET_IRED
		if (!tmr_ired) {
			if (decodeIRED(&results)) {
				tmr_ired = getTimer(_300ms);
				IRRED_LED();
				int8_t kid = -1;
				for (int8_t i = 0; i < MAX_IRED_KEY; i++) {
					if (results.value == keyAll[i].code) {
						kid = i;
						break;
					}
				}
#if defined(SET_OLED_SPI)
				int8_t k;
				if (kid == -1) k = sprintf(line, " CODE:%08lX ", results.value);
				          else k = sprintf(line, " irKEY: %s ", keyAll[kid].name);
				if (k < len8) spi_ssd1306_clear_line(8);
				len8 = k;
				spi_ssd1306_text_xy(line, 1, 8);
#elif defined(SET_IPS)
				if (kid == -1) sprintf(line, "CODE:%08lX", results.value);
				          else sprintf(line, "irKEY: %s", keyAll[kid].name);
				//ST7789_Fill(0, ST7789_WIDTH - fntKey.height, ST7789_WIDTH - 1, ST7789_HEIGHT - 1, YELLOW);
				ST7789_WriteString(0, ST7789_WIDTH - fntKey->height, mkLineCenter(line, ST7789_WIDTH / fntKey->width), *fntKey, MAGENTA, YELLOW);
#endif
				if (kid != -1) {
					switch (kid) {
						case key_100: jtune = 1; break;
						case key_200: jtune = 0; break;

						case key_minus:
							if (cikl_out >= 200) cikl_out -= 100;
						break;
						case key_plus:
							if (cikl_out < 30000) cikl_out += 100;
						break;

						case key_0: outMode = textMode;  break;
						case key_1: outMode = jsonMode;  break;
						case key_2: outMode = cjsonMode; break;

						case key_3: outDebug = 1; break;//dbg_on
						case key_4: outDebug = 0; break;//dbg_off
#ifdef SET_BLE
						case key_7:
							bleCmd = iMAC;
							putMsg(msg_wrBLE);
						break;
						case key_8:
							bleCmd = iUUID;
							putMsg(msg_wrBLE);
						break;
						case key_9: bleReset(0); break;
#endif
						case key_ch: putMsg(msg_rst); break;//rst

