salara1960/stm32f411/Src/main.c
						case key_eq: tmr_out = getTimer(_1ms); break;//out
#ifdef SET_NET
						case key_left://udp_on / udp_off
							en_udp++; en_udp &= 1;
							if (!en_udp) {
								if (usoc == udpSOC) close(udpSOC);
								usoc = -1;
								cnt_udp = 0;
								udp_pack_num = 0;
							}
						break;
						case key_right://tcp_on / tcp_off
						{
							en_tcp++; en_tcp &= 1;
							if (!en_tcp) {
								if (tsoc == tcpSOC) {
									if (con_tcp) disconnect(tcpSOC);
									close(tcpSOC);
								}
								tsoc = -1;
								con_tcp = 0;
	#ifdef SET_NET_DEBUG
								uint8_t sta = getSn_SR(tcpSOC);
								Report(NULL, 0, "\t[%s] (%u) Device closed tcp server\r\n", socStatus(sta), sta);
	#endif
							}
						}
						break;
						case key_sp://get PHY status register
							getPhyStatus();
						break;
#endif
					}
				}
			}
		}

		if (tmr_ired) {
			if (chkTimer(tmr_ired)) {
				tmr_ired = 0;
				resumeIRED();
				IRRED_LED();
			}
		}
#endif

		if (chkTimer(tmr_prn)) {
			printData();
			tmr_prn = getTimer(2);
		}

#ifdef SET_BLE
		if (tmr_ble_auth) {
			if (chkTimer(tmr_ble_auth)) {
				tmr_ble_auth = 0;
				bleDisconnect();
			}
		}
#endif

		switch (getMsg()) {

#ifdef SET_NET
			case msg_mkUdp:
				if (usoc < 0) {
					usoc = socket(udpSOC, Sn_MR_UDP, udpPort, netFlag);
				}
			break;
			case msg_mkTcp:
				if (tsoc < 0) {
					tsoc = socket(tcpSOC, Sn_MR_TCP, tcpPort, netFlag);
					if (tsoc == tcpSOC) {
						stat_tcp = listen(tcpSOC);
	#ifdef SET_NET_DEBUG
						Report(NULL, 0, "\tTcp socket create OK. Listen (%d) tcp client...\r\n", stat_tcp);
	#endif
						putMsg(msg_mkListen);
					}
				}
			break;
			case msg_mkListen:
				statSR = getSn_SR(tcpSOC);
				//if (statSR == SOCK_LISTEN) {
				//	putMsg(msg_mkListen);
				//} else
				if (statSR == SOCK_ESTABLISHED) {
					if (!con_tcp) {
						getsockopt(tcpSOC, SO_DESTIP, &cliIP);
						con_tcp = 1;
						memset(tcpBuf, 0, sizeof(tcpBuf));
	#ifdef SET_NET_DEBUG
						Report(NULL, 0, "\t[%s] Connect to client:  %d.%d.%d.%d\r\n", socStatus(statSR), cliIP[0], cliIP[1], cliIP[2], cliIP[3]);
	#endif
						/*en_udp = 0;
						if (usoc == udpSOC) {
							close(udpSOC);
							usoc = -1;
							cnt_udp = 0;
							udp_pack_num = 0;
						}*/
					}
				} else if (statSR < 0) {
					close(tcpSOC);
					tsoc = -1;
					con_tcp = 0;
	#ifdef SET_NET_DEBUG
					Report(NULL, 0, "\t[%s] Socket error %d\r\n", socStatus(statSR), statSR);
	#endif
				} else {
					putMsg(msg_mkListen);
				}
			break;
#endif
		    case msg_adcReady:
		    {
		    	adcValue = (uint16_t)HAL_ADC_GetValue(portADC) & 0xfff;// * 0.80586;
		    	//
		    	if (VccAddVal(adcValue) == MAX_VCC_BUF) {//в окне накоплено MAX_VCC_BUF выборок -> фильтрация !
		    		uint16_t sum = 0;
		    		for (int8_t j = 0; j < MAX_VCC_BUF; j++) sum += VccBuf[j];
		    		sum /= MAX_VCC_BUF;
		    		VccF = (float)(sum * 0.80586) / 1000;
		    	}
		    	//
		    	startADC = 1;
		    }
		    break;
		    case msg_10ms:
		    	schMS++;
		    	//
#ifdef SET_NET
		    	if (usoc < 0) {
		    		if (en_udp) putMsg(msg_mkUdp);
		    	}
		    	//
		    	if (tsoc < 0) {
		    		if (en_tcp) putMsg(msg_mkTcp);
		    	} else {
		    		statSR = getSn_SR(tcpSOC);
		    		if (statSR == SOCK_CLOSE_WAIT) {
		    			if (tsoc == tcpSOC) close(tcpSOC);
		    			tsoc = -1;
		    			con_tcp = 0;
	#ifdef SET_NET_DEBUG
		    			Report(NULL, 0, "\t[%s] (%d) Disconnect client:  %d.%d.%d.%d\r\n",
		    								socStatus(statSR), statSR,
											cliIP[0], cliIP[1], cliIP[2], cliIP[3]);
	#endif
		    		}
		    		if (con_tcp) {
		    			int32_t rlen = recv(tcpSOC, (uint8_t *)tcpTmp, 64);
		    			if (rlen > 0) {
		    				if (sizeof(tcpBuf) > (rlen + strlen(tcpBuf))) {
		    					strncat(tcpBuf, tcpTmp, rlen);
		    					if (strstr(tcpBuf, "\r\n")) {
		    						int rl = strlen(tcpBuf);
		    						strncpy(stx, tcpBuf, rl);
		    						tcpBuf[0] = '\0';
		    						stx[rl] = '\0';
		    						putMsg(msg_rxDone);
		    					}
		    				} else {
		    					tcpBuf[0] = '\0';
		    				}
		    			}
		    		}
		    	}
#endif
		    	//
		    	if (tmr_out) {
		    		if (chkTimer(tmr_out)) {
		    			tmr_out = 0;
		    			putMsg(msg_out);
		    		}
		    	}
		    	//
		    	if (!setRTC) {
		    		setRTC = 1;
		    		set_Date(epoch);
		    		setSec(get_DateTime());
		    	}
		    	//
		    	if (!(schMS % (_100ms))) {// 100ms
		    		if (startADC) HAL_ADC_Start_IT(portADC);
		    		if (devError) ON_ERR_LED()
		    		         else OFF_ERR_LED()
		    		//
		    	}
		    	//
		    	//printData();
		    	//
		    break;
		    case msg_sec:
		    	led_OnOff();
		    	//
		    	if (!first_sec) {
		    		first_sec = 1;
		    		set_Date((time_t)(epoch + 1));
		    	}
		    	//
#if defined(SET_OLED_SPI) || defined(SET_IPS)
		    	sec_to_str_time(line);
#endif
#if defined(SET_OLED_SPI)
		    	//print time
		    	spi_ssd1306_text_xy(line, 2, 1);
		    	toDisplay(line);
#elif defined(SET_IPS)
		    	//print time
		    	ST7789_WriteString(0, 0, mkLineCenter(line, ST7789_WIDTH / fntKey->width), *fntKey, RED, WHITE);
		    	toDisplay(line);
		    	//netChipID
		    	if (!con_tcp) {
		    		sprintf(line, "chip : %s", netChipID);
		    	} else {
		    		sprintf(line, " %d.%d.%d.%d", cliIP[0], cliIP[1], cliIP[2], cliIP[3]);
		    	}
		    	ST7789_WriteString(0, ST7789_WIDTH - fntKey->height, mkLineCenter(line, ST7789_WIDTH / fntKey->width), *fntKey, MAGENTA, YELLOW);
#endif
		    	//
#ifdef SET_NET
		    	if (ip_assigned) {
		    		if (usoc < 0) putMsg(msg_mkUdp);
		    		else {
		    			udp_sec--;
		    			if (!udp_sec) {
		    				udp_sec = udp_sec_period;
		    				if (en_udp) {
		    					sec_to_str_time(line);
		    					mlen = sprintf(udpText, "[%ld] %s | device=%s ip=%s\r\n", ++udp_pack_num, line, netChipID, localIP);
		    					stat_udp = sendto(udpSOC, (uint8_t *)udpText, mlen, udpAddr, udpPort);
		    					if (netFlag & SF_IO_NONBLOCK) {
		    						if (stat_udp == mlen) cnt_udp++;
		    						else {
		    							if (stat_udp == SOCK_BUSY) cnt_udp++; else cnt_udp = stat_udp;
		    						}
		    					} else {
		    						if (stat_udp > 0) cnt_udp++; else cnt_udp = stat_udp;
		    					}
	#ifdef SET_OLED_SPI
		    					sprintf(line, "   udp: %d", (int)cnt_udp);
		    					//sprintf(line, "  cnt_data: %u", cnt_data);
		    					spi_ssd1306_clear_line(8);
		    					spi_ssd1306_text_xy(line, 1, 8);
		    					//Report(NULL, 0, "\t%s", udpText);
	#endif
		    					if (stat_udp <= 0) {
		    						if (cnt_udp > 0) cnt_udp--;
		    					}
		    				}
		    			}
		    		}
		    	}
#endif
		    break;
			case msg_rxDone:
				Report(NULL, 0, stx);
				ackParse(stx);
			break;
#ifdef SET_BLE
			case msg_wrBLE:
				bleWrite(bleCmd, NULL);
			break;
			case msg_rxDoneBLE:
			{
				//
				switch (bleAckParse(stx_ble)) {
					case ackCON:
						con_ble = 1;
						//tmr_ble_auth = getTimer(_5s);
tmr_ble_auth = 0;
ble_auth = 1;
					break;
					case ackPWD:
						tmr_ble_auth = 0;
						ble_auth = 1;
					break;
					case ackDISC:
						con_ble = ble_auth = 0;
						tmr_ble_auth = 0;
					break;
					default : ackParse(stx_ble);
				}
				//
				if (ble_ack_wait) ble_ack_wait = 0;
				Report(NULL, 0, stx_ble);
	#ifdef SET_OLED_SPI
				spi_ssd1306_clear_line(8);
				stx_ble[15] = '\0';
				uint8_t x = spi_ssd1306_calcx(strlen(stx_ble));
				spi_ssd1306_text_xy(stx_ble, x, 8);
	#endif
	#ifdef SET_IPS
				strcpy(line, stx_ble);
		    	ST7789_WriteString(0, ST7789_WIDTH - fntKey->height, mkLineCenter(line, ST7789_WIDTH / fntKey->width), *fntKey, MAGENTA, YELLOW);
	#endif
			}
			break;
#endif
			case msg_rst:
#ifdef SET_BLE
				bleDisconnect();
#endif
				HAL_Delay(800);
				NVIC_SystemReset();
			break;
			case msg_out:
				tmr_out = getTimer(cikl_out);
				uint8_t with_dt = 0;
				if (outMode == textMode) with_dt = 1;
				Report(NULL, with_dt, "%s\r\n", printOut(tmp));
			break;
#ifndef SET_COMPAS_BLOCK
			case msg_i2c:
				switch (siCmd) {
#ifdef SET_COMPAS
					case msg_startCompas:
						if (chkTimer(next)) {
							//
							//STROB_DOWN();
							//
							msBegin = HAL_GetTick();
							next = 0;
							procCompas();
							//
						} else {
							putMsg(msg_i2c);
						}
					break;
					case msg_getCompas:
						//
						if (CompAddVal(COPMAS_CalcAngle()) == MAX_COMP_BUF) {//в окне накоплено MAX_VCC_BUF выборок -> фильтрация !
							float sum = 0;
							for (int8_t j = 0; j < MAX_COMP_BUF; j++) sum += CompBuf[j];
							sum /= MAX_COMP_BUF;
							compData.angleHMC = sum;
						}
						//
						siCmd = msg_empty;
						next = 0;
						putMsg(msg_nextSens);
						//
					break;
#endif
					case msg_rdyTest:
						//
						if (chkTimer(next)) {
							i2c_test_ready_bmx280(&info_bmp280);
							next = 0;//getTimer(_5ms);
						} else {
							siCmd = msg_rdyTest;
							putMsg(msg_i2c);
						}
						//
					break;
					case msg_rdyStat:
						//if (chkTimer(next)) {
						//	next = 0;
							bStat = i2c_getStat_bmx280();
							if (!bStat) {
								errStatCnt++;
								if (errStatCnt < 10) {
									siCmd = msg_rdyTest;
									putMsg(msg_i2c);
								} else {
									devError |= devI2C1;
									errStatCnt = 0;
								}
								break;
							}
							//
							if (i2c_read_data_bmx280(data_rdx, d_size) != HAL_OK) devError |= devI2C1;
							//
						//} else {
						//	siCmd = msg_rdyStat;
						//	putMsg(msg_i2c);
						//}
					break;
					case msg_readBMX:
						//
						if (!bmxCalibr) bmx280_readCalibr1Data(reg_id);//goto read calibration data part 1
						else {
							bmx280_CalcAll(&sensors, reg_id);
#ifdef SET_MPU6050
							if (mpuPresent) {
								//
	#ifdef SET_MPU_INTERRUPT
								mpuEnableInterrupts();
	#else
								siCmd = msg_mpuAllRead;
								putMsg(msg_i2c);
	#endif
							} else putMsg(msg_endNext);
#else
							putMsg(msg_endNext);
#endif
						}
						//
					break;
					case msg_calibr1Done:
						//
						bmx280_calcCalibr1Data(reg_id);
						if (reg_id == BME280_SENSOR) {
							bmx280_readCalibr2Data(reg_id);
						} else {
							bmx280_CalcAll(&sensors, reg_id);
#ifdef SET_MPU6050
							if (mpuPresent) {
								siCmd = msg_mpuAllRead;
								putMsg(msg_i2c);
							} else putMsg(msg_endNext);
#else
							putMsg(msg_endNext);
#endif
						}
						//
					break;
					case msg_calibr2Done:
						//
						if (reg_id == BME280_SENSOR) bmx280_calcCalibr2Data();
						bmx280_CalcAll(&sensors, reg_id);
						bmxCalibr = true;
#ifdef SET_MPU6050
						if (mpuPresent) {
							//
	#ifdef SET_MPU_INTERRUPT
							mpuEnableInterrupts();
	#else
							siCmd = msg_mpuAllRead;
							putMsg(msg_i2c);
	#endif
						} else putMsg(msg_endNext);
#else
						putMsg(msg_endNext);
#endif
						//
					break;
#ifdef SET_MPU6050
					case msg_mpuAllRead:
						//
	#ifndef SET_MPU_INTERRUPT
						mpuStatus = mpuReadStatus();//!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
	#endif
						//
						mpuAllRead();//start read all data from adr 0x3b....(14 bytes)
						//
					break;
					case msg_mpuAllReady:
						//
						mpuConvData();
						//STROB_UP();
						putMsg(msg_endNext);
						//
					break;
	#endif
				}
			break;
#else
			case msg_startCompas:
			{
				if (chkTimer(next)) {
					//STROB_DOWN();
					//
					msBegin = HAL_GetTick();
					next = 0;
					procCompas();

					//
					if (CompAddVal(COPMAS_CalcAngle()) == MAX_COMP_BUF) {//в окне накоплено MAX_VCC_BUF выборок -> фильтрация !
						float sum = 0;
						for (int8_t j = 0; j < MAX_COMP_BUF; j++) sum += CompBuf[j];
						sum /= MAX_COMP_BUF;
						compData.angleHMC = sum;
					}
					//
					putMsg(msg_nextSens);
					//
					//STROB_UP();
				} else putMsg(msg_startCompas);
			}
			break;
#endif
#ifdef SET_MPU9250
			case msg_startMPU:
				if (chkTimer(next)) {
					//STROB_DOWN();
					//
					mpuStatus = MPU9250_getStat();
					if (mpuStatus) {
						MPU9250_GetData(&mpu_akm_data);
						MPU9250_CalcAll(&mpu_akm_data);
					}
					//
					next = 0;//getTimer(_1ms);
					putMsg(msg_nextSens);
					//
					//STROB_UP();
				} else putMsg(msg_startMPU);
			break;
#endif
			case msg_nextSens:
				if (chkTimer(next)) {
					//STROB_DOWN();
					//
#ifdef SET_BMx280
					//
					if (i2c_test_bmx280(&info_bmp280, reg_id) != HAL_OK) devError |= devI2C1;
					next = getTimer(_1ms);
	#ifdef SET_COMPAS_BLOCK
					bStat = i2c_getStat_bmx280();
					if (!bStat) {
						next = getTimer(_1ms);
						putMsg(msg_nextSens);
						break;
					}
					//
					if (i2c_read_bmx280(BMP280_REG_PRESSURE, data_rdx, d_size) == HAL_OK) {
						//
						if (!bmxCalibr) bmxCalibr = bmx280_readCalibrationData(reg_id);
						//
						bmx280_CalcAll(&sensors, reg_id);
						//
					} else devError |= devI2C1;
					putMsg(msg_endNext);
	#endif
#endif
					//STROB_UP();
				} else putMsg(msg_nextSens);
			break;
			case msg_endNext:
				//
				//
				//
				msCnt = HAL_GetTick() - msBegin;
				if (msCnt < msPeriod) {
					msCnt = msPeriod - msCnt;
				} else {
					msCnt -= msPeriod;
				}
				if (!msCnt) msCnt++;
				next = getTimer(msCnt);
				//
#ifdef SET_COMPAS
	#ifdef SET_COMPAS_BLOCK
				evt = msg_startCompas;
				siCmd = msg_empty;
	#else
				evt = msg_i2c;
				siCmd = msg_startCompas;
	#endif
#else
	#if defined(SET_MPU9250)
				evt = msg_startMPU;
				siCmd = msg_empty;
	#elif defined(SET_BMx280)
				evt = msg_nextSens;
				siCmd = msg_empty;
	#endif
#endif
				putMsg(evt);
				//
				//STROB_UP();
			break;
		}

		//
		//printData();
		//

    /* USER CODE END WHILE */

